"""Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и
получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых
трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется
написать программу, которая проверяет счастливость билета.

*Пример:*

385916 -> yes
123456 -> no"""


x = int(input(f'Введите шестизначное число: '))
summ = 0
summ1 = 0
count = 0
while count < 3:
    summ += x % 10
    x = x // 10
    count += 1
while count < 6:
    summ1 += x % 10
    x = x // 10
    count += 1
if summ == summ1:
    print(f"Число палиндром")
else:
    print(f" не палиндром")