# Задача 2: Найдите сумму цифр трехзначного числа.
#
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

x = int(input(f'Введите трехзначное число: '))
summ = 0
count = 0
while count < 3:
    summ += x % 10
    x = x // 10
    count += 1

print(summ)